case3-checkingEulerianCellThreshold/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0) //0
    (2 0 0) //1
    (3 0 0) //2
    (5 0 0) //3

    (0 5 0) //4
    (2 5 0) //5
    (3 5 0) //6
    (5 5 0) //7

    (2 -1 2) //8
    (3 -1 2) //9

    (0 0 2) //10
    (2 0 2) //11
    (3 0 2) //12
    (5 0 2) //13

    (0 5 2) //14
    (2 5 2) //15
    (3 5 2) //16
    (5 5 2) //17

    (2 -1 3) //18
    (3 -1 3) //19

    (0 0 3) //20
    (2 0 3) //21
    (3 0 3) //22
    (5 0 3) //23

    (0 5 3) //24
    (2 5 3) //25
    (3 5 3) //26
    (5 5 3) //27

    (0 0 5) //28
    (2 0 5) //29
    (3 0 5) //30
    (5 0 5) //31

    (0 5 5) //32
    (2 5 5) //33
    (3 5 5) //34
    (5 5 5) //35
);

blocks
(
    hex (0 1 5 4 10 11 15 14) (20 50 20) simpleGrading (1 1 1) //block1
    hex (1 2 6 5 11 12 16 15) (10 50 20) simpleGrading (1 1 1) //block2
    hex (2 3 7 6 12 13 17 16) (20 50 20) simpleGrading (1 1 1) //block3
    hex (10 11 15 14 20 21 25 24) (20 50 10) simpleGrading (1 1 1) //block4
    hex (11 12 16 15 21 22 26 25) (10 50 10) simpleGrading (1 1 1) //block5
    hex (12 13 17 16 22 23 27 26) (20 50 10) simpleGrading (1 1 1) //block6
    hex (20 21 25 24 28 29 33 32) (20 50 20) simpleGrading (1 1 1) //block7
    hex (21 22 26 25 29 30 34 33) (10 50 20) simpleGrading (1 1 1) //block8
    hex (22 23 27 26 30 31 35 34) (20 50 20) simpleGrading (1 1 1) //block9
    hex (8 9 12 11 18 19 22 21) (10 10 10) simpleGrading (1 1 1) //block10
);

edges
(
);

boundary
(
    
    inlet
    {
        type patch;
        faces
        (
            (8 9 19 18)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (4 5 15 14)
            (5 6 16 15)
            (6 7 17 16)
            (14 15 25 24)
            (15 16 26 25)
            (16 17 27 26)
            (24 25 33 32)
            (25 26 34 33)
            (26 27 35 34)
        );
    }
    
    
    nozzleWall
    {
        type wall;
        faces
        (
            (8 9 12 11)
            (18 8 11 21)
            (18 19 22 21)
            (19 9 12 22)
        );
    }
    
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 11 10)
            (1 2 12 11)
            (2 3 13 12)
            (10 11 21 20)
            (12 13 23 22)
            (20 21 29 28)
            (21 22 30 29)
            (22 23 31 30)
        );
    }
    
    leftWall
    {
        type wall;
        faces
        (
            (0 4 14 10)
            (10 14 24 20)
            (20 24 32 28)
        );
    }
    
    rightWall
    {
        type wall;
        faces
        (
            (3 7 17 13)
            (13 17 27 23)
            (23 27 35 31)
        );
    }
    
    backWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
        );
    }
    
    frontWall
    {
        type wall;
        faces
        (
            (28 29 33 32)
            (29 30 34 33)
            (30 31 35 34)
        );
    }
    

);

mergePatchPairs
(
);


// ************************************************************************* //
